In [1]:
#CMS Pandas Tutorials 9

In [2]:
import pandas as pd
import numpy as np

In [3]:
people = {
    'first':['Debasis', 'Jane', 'John', 'Chirs', np.nan, None, 'NA'],
    'last':['Nath', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'],
    'email':['debasisnath@outlook.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'ananomaous@email.com', None],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}

In [4]:
df0 = pd.DataFrame(people)

In [5]:
df0

     first     last                    email      age
0  Debasis     Nath  debasisnath@outlook.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chirs  Schafer                     None       36
4      NaN      NaN                      NaN     None
5     None      NaN     ananomaous@email.com     None
6       NA  Missing                     None  Missing

In [6]:
df0.dropna()

     first  last                    email age
0  Debasis  Nath  debasisnath@outlook.com  33
1     Jane   Doe        JaneDoe@email.com  55
2     John   Doe        JohnDoe@email.com  63

In [7]:
df0.dropna(axis='index', how='any')

     first  last                    email age
0  Debasis  Nath  debasisnath@outlook.com  33
1     Jane   Doe        JaneDoe@email.com  55
2     John   Doe        JohnDoe@email.com  63

In [8]:
df0.dropna(axis='index', how='all', subset=['email', 'last'])

     first     last                    email      age
0  Debasis     Nath  debasisnath@outlook.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chirs  Schafer                     None       36
5     None      NaN     ananomaous@email.com     None
6       NA  Missing                     None  Missing

In [9]:
df0.replace('NA', np.nan, inplace=True)
df0.replace('Missing', np.nan, inplace=True)

In [10]:
df

NameError: name 'df' is not defined

In [ ]:
df0.isna()

In [ ]:
df0.fillna('MISSING')

In [ ]:
df0.dtypes

In [ ]:
type(np.nan)

In [ ]:
df0['age'] = df0['age'].astype(float)

In [ ]:
df0

In [ ]:
df0.dtypes

In [ ]:
df0['age'].mean()

In [ ]:
df0['age'].median()

In [ ]:
na_vals = ['NA', 'Missing']
df = pd.read_csv('data/survey_results_public.csv', na_values=na_vals )
schema_df = pd.read_csv('data/survey_results_schema.csv')

In [ ]:
pd.set_option('display.max_columns', 85)
pd.set_option('display.max_rows', 85)

In [ ]:
 df['YearsCode']

In [ ]:
 df['YearsCode'].astype(float)

In [ ]:
df['YearsCode'].unique()

In [ ]:
df['YearsCode'].replace('Less than 1 year', 0, inplace=True)
df['YearsCode'].replace('More than 50 years', 51, inplace=True)

In [ ]:
df['YearsCode'].unique()

In [ ]:
df['YearsCode'] = df['YearsCode'].astype(float)

In [ ]:
df['YearsCode'].median()